tutorials/tgv3D/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application pimpleFoam; startFrom startTime; startTime 0; stopAt endTime; endTime 0.5; deltaT 0.1; adjustTimeStep no;
writeControl timeStep; writeInterval 5; writeFormat binary; writePrecision 12; timeFormat general; timePrecision 8; runTimeModifiable no;
functions { kineticEnergyAudit { type kineticEnergyAudit; libs (cosamEnergyAuditFunctionObjects); writeFields true; writeControl writeTime; } }
