tutorials/tgv3D/system/setExprFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setExprFieldsDict; }
expressions
(
    U { field U; dimensions [0 1 -1 0 0 0 0];
        expression #{ vector(sin(pos().x())*cos(pos().y())*cos(pos().z()), -cos(pos().x())*sin(pos().y())*cos(pos().z()), 0) #}; }
    p { field p; dimensions [0 2 -2 0 0 0 0];
        expression #{ (cos(2*pos().x()) + cos(2*pos().y()))*(cos(2*pos().z()) + 2)/16 #}; }
);
